Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: You have opted out of the career development plan
th_th: คุณได้เลือกไม่เข้าร่วมแผนพัฒนาสายอาชีพ

source: Uploaded files
th_th: ไฟล์ที่อัปโหลดแล้ว

source: Uploaded by: {{name}}
th_th: อัปโหลดโดย: {{name}}

source: Automatically, using a deliverable
th_th: โดยอัตโนมัติ โดยใช้สิ่งที่ต้องส่งมอบ

source: Automatically, using the average of measurement criteria
th_th: โดยอัตโนมัติ โดยใช้ค่าเฉลี่ยของเกณฑ์การวัด

source: Audit trail
th_th: บันทึกการตรวจสอบย้อนหลัง

source: This comment was deleted.
th_th: ความคิดเห็นนี้ถูกลบแล้ว

source: Discussion
th_th: การสนทนา

source: Worker, Manager
th_th: พนักงาน ผู้จัดการ

source: Aligned with goal
th_th: สอดคล้องกับเป้าหมาย

source: Goals aligned with this goal
th_th: เป้าหมายที่สอดคล้องกับเป้าหมายนี้

source: {{name}} - Individual goal
th_th: {{name}} - เป้าหมายส่วนบุคคล

source: {{name}} - Organizational goal
th_th: {{name}} - เป้าหมายขององค์กร

source: No due date
th_th: ไม่มีวันครบกำหนด

source: <0>{{userName}}</0> added alignments.
th_th: <0>{{userName}}</0> ได้เพิ่มการเชื่อมโยงให้สอดคล้องกันแล้ว

source: <0>{{userName}}</0> deleted alignments.
th_th: <0>{{userName}}</0> ลบการจัดตำแหน่งแล้ว

source: <0>{{userName}}</0> added a file.
th_th: <0>{{userName}}</0> เพิ่มไฟล์แล้ว

source: <0>{{userName}}</0> deleted a file.
th_th: <0>{{userName}}</0> ลบไฟล์แล้ว

source: <0>{{userName}}</0> added a deliverable.
th_th: <0>{{userName}}</0> ได้เพิ่มผลงานที่ต้องส่ง

source: <0>{{userName}}</0> deleted a deliverable.
th_th: <0>{{userName}}</0> ลบสิ่งที่ต้องส่งแล้ว

source: <0>{{userName}}</0> marked a deliverable as done.
th_th: <0>{{userName}}</0> ได้ทำเครื่องหมายให้งานส่งมอบเสร็จสิ้นแล้ว

source: <0>{{userName}}</0> marked a deliverable as undone.
th_th: <0>{{userName}}</0> ทำเครื่องหมายว่างานที่ส่งแล้วเสร็จยังไม่เสร็จ

source: <0>{{userName}}</0> updated a deliverable.
th_th: <0>{{userName}}</0> ได้อัปเดตงานส่งมอบแล้ว

source: <0>{{userName}}</0> updated the description.
th_th: <0>{{userName}}</0> ได้อัปเดตคำอธิบายแล้ว

source: <0>{{userName}}</0> updated the due date.
th_th: <0>{{userName}}</0> ได้อัปเดตวันที่ครบกำหนดแล้ว

source: No date
th_th: ไม่มีวันที่

source: No progress
th_th: ไม่มีความคืบหน้า

source: No status
th_th: ไม่มีสถานะ

source: No weight
th_th: ไม่มีน้ำหนัก

source: <0>{{userName}}</0> reset the end date for <1>{{participantName}}</1> to the initial date.
th_th: <0>{{userName}}</0> รีเซ็ตวันสิ้นสุดสำหรับ <1>{{participantName}}</1> กลับเป็นวันเริ่มต้นเดิม

source: <0>{{userName}}</0> set the end date for <1>{{participantName}}</1>.
th_th: <0>{{userName}}</0> กำหนดวันสิ้นสุดให้กับ <1>{{participantName}}</1>

source: <0>{{userName}}</0> set the end date for the goal.
th_th: <0>{{userName}}</0> ได้ตั้งค่าวันสิ้นสุดสำหรับเป้าหมายนี้แล้ว

source: <0>{{userName}}</0> changed the end date for <1>{{participantName}}</1>.
th_th: <0>{{userName}}</0> ได้เปลี่ยนวันที่สิ้นสุดสำหรับ <1>{{participantName}}</1>

source: <0>{{userName}}</0> changed the end date for the goal.
th_th: <0>{{userName}}</0> ได้เปลี่ยนวันสิ้นสุดของเป้าหมายแล้ว

source: From:
th_th: จาก:

source: <0>{{userName}}</0> approved a goal.
th_th: <0>{{userName}}</0> อนุมัติเป้าหมายแล้ว

source: <0>{{userName}}</0> created a goal.
th_th: <0>{{userName}}</0> ได้สร้างเป้าหมายแล้ว

source: <0>{{userName}}</0> rejected a goal.
th_th: <0>{{userName}}</0> ปฏิเสธเป้าหมาย

source: <0>{{userName}}</0> deleted a goal.
th_th: <0>{{userName}}</0> ลบเป้าหมายหนึ่งรายการแล้ว

source: <0>{{userName}}</0> marked a goal as done.
th_th: <0>{{userName}}</0> ทำเครื่องหมายว่าเป้าหมายเสร็จสิ้นแล้ว

source: <0>{{userName}}</0> reopened a goal.
th_th: <0>{{userName}}</0> เปิดเป้าหมายขึ้นมาอีกครั้ง

source: <0>{{userName}}</0> submitted a goal for approval.
th_th: <0>{{userName}}</0> ส่งเป้าหมายเพื่อขออนุมัติแล้ว

source: <0>{{userName}}</0> added a measurement criterion.
th_th: <0>{{userName}}</0> ได้เพิ่มเกณฑ์การวัดผลแล้ว

source: <0>{{userName}}</0> deleted a measurement criterion.
th_th: <0>{{userName}}</0> ลบเกณฑ์การวัดออกแล้ว

source: <0>{{userName}}</0> updated a measurement criterion.
th_th: <0>{{userName}}</0> ได้อัปเดตเกณฑ์การวัดผลแล้ว

source: <0>{{userName}}</0> updated the population of a goal.
th_th: <0>{{userName}}</0> ได้อัปเดตกลุ่มพนักงานของเป้าหมายแล้ว

source: <0>{{userName}}</0> updated a goal priority.
th_th: <0>{{userName}}</0> ได้อัปเดตลำดับความสำคัญของเป้าหมาย

source: <0>{{userName}}</0> updated the progress settings of a goal.
th_th: <0>{{userName}}</0> ได้อัปเดตการตั้งค่าความคืบหน้าของเป้าหมาย

source: <0>{{userName}}</0> updated the progress of a goal.
th_th: <0>{{userName}}</0> ได้อัปเดตความคืบหน้าของเป้าหมายแล้ว

source: <0>{{userName}}</0> reset the dates for the goal population to the initial dates.
th_th: <0>{{userName}}</0> รีเซ็ตช่วงวันที่สำหรับกลุ่มเป้าหมายกลับเป็นวันที่เริ่มต้นเดิม

source: <0>{{userName}}</0> reset the start date for <1>{{participantName}}</1> to the initial date.
th_th: <0>{{userName}}</0> รีเซ็ตวันที่เริ่มต้นสำหรับ <1>{{participantName}}</1> กลับไปเป็นวันที่เริ่มต้นเดิมแล้ว

source: <0>{{userName}}</0> set the start date for <1>{{participantName}}</1>.
th_th: <0>{{userName}}</0> กำหนดวันที่เริ่มต้นให้กับ <1>{{participantName}}</1>.

source: <0>{{userName}}</0> set the start date for the goal.
th_th: <0>{{userName}}</0> ตั้งค่าวันเริ่มต้นของเป้าหมาย

source: <0>{{userName}}</0> changed the start date for <1>{{participantName}}</1>.
th_th: <0>{{userName}}</0> ได้เปลี่ยนวันที่เริ่มต้นสำหรับ <1>{{participantName}}</1>

source: <0>{{userName}}</0> changed the start date for the goal.
th_th: <0>{{userName}}</0> ได้เปลี่ยนวันที่เริ่มต้นของเป้าหมายแล้ว

source: <0>{{userName}}</0> updated a title.
th_th: <0>{{userName}}</0> ได้อัปเดตชื่อตำแหน่งงาน

source: To:
th_th: ถึง:

source: <0>{{userName}}</0> updated a goal tracking status.
th_th: <0>{{userName}}</0> ได้อัปเดตสถานะการติดตามเป้าหมายแล้ว

source: Progress trail
th_th: เส้นทางความคืบหน้า

source: <0>{{userName}}</0> changed the goal weight.
th_th: <0>{{userName}}</0> ได้เปลี่ยนน้ำหนักของเป้าหมายแล้ว

source: <0>{{userName}}</0> reset the goal weight for <1>{{participantName}}</1> to the initial weight.
th_th: <0>{{userName}}</0> รีเซ็ตค่าน้ำหนักเป้าหมายของ <1>{{participantName}}</1> กลับเป็นค่าน้ำหนักเริ่มต้น

source: <0>{{userName}}</0> reset the goal weight for the goal population to the initial weight.
th_th: <0>{{userName}}</0> ได้รีเซ็ตค่าน้ำหนักของเป้าหมายสำหรับกลุ่มเป้าหมายของเป้าหมายกลับเป็นน้ำหนักเริ่มต้นแล้ว

source: <0>{{userName}}</0> set the weight of a goal for <1>{{participantName}}</1>.
th_th: <0>{{userName}}</0> ตั้งค่าน้ำหนักของเป้าหมายให้กับ <1>{{participantName}}</1>.

source: <0>{{userName}}</0> changed the weight of a goal.
th_th: <0>{{userName}}</0> ได้เปลี่ยนน้ำหนักของเป้าหมายแล้ว

source: <0>{{userName}}</0> updated the goal weight for <1>{{participantName}}</1>.
th_th: <0>{{userName}}</0> ได้อัปเดตน้ำหนักเป้าหมายสำหรับ <1>{{participantName}}</1> แล้ว

source: No value
th_th: ไม่มีค่า

source: Average score
th_th: คะแนนเฉลี่ย

source: Max score
th_th: คะแนนสูงสุด

source: Overall {{title}} score
th_th: คะแนนรวมของ {{title}}

source: Overall goal score
th_th: คะแนนเป้าหมายโดยรวม

source: Weight factor
th_th: ปัจจัยน้ำหนัก

source: Delivered
th_th: ส่งมอบแล้ว

source: Not delivered
th_th: ยังไม่ส่งแล้วเสร็จ

source: No description
th_th: ไม่มีคำอธิบาย

source: Additional goal description
th_th: คำอธิบายเป้าหมายเพิ่มเติม

source: Overall behavior review
th_th: ภาพรวมการทบทวนพฤติกรรม

source: Overall goal review
th_th: ภาพรวมการทบทวนเป้าหมาย

source: Challenge review
th_th: ทบทวนการโต้แย้ง

source: Overall performance - Discussion outcome
th_th: ผลงานโดยรวม - ข้อสรุปจากการสนทนา

source: I acknowledge having had a performance coaching conversation with my manager.
th_th: ข้าพเจ้ายืนยันว่าได้มีการสนทนาเรื่องการโค้ชด้านผลงานกับผู้จัดการของข้าพเจ้าแล้ว

source: Custom widget
th_th: วิดเจ็ตกำหนดเอง

source: The Team member performance rating widget is a powerful tool designed specifically for managers to assess and rate the performance of their team members. It provides a convenient and efficient way for managers to track and evaluate individual performance, foster accountability, and make informed decisions regarding their team.
th_th: วิดเจ็ตการให้คะแนนผลงานสมาชิกทีมเป็นเครื่องมืออันทรงพลังที่ออกแบบมาโดยเฉพาะสำหรับผู้จัดการ เพื่อใช้ประเมินและให้คะแนนผลงานของสมาชิกในทีม โดยมอบวิธีการที่สะดวกและมีประสิทธิภาพให้ผู้จัดการสามารถติดตามและประเมินผลงานรายบุคคล ส่งเสริมความรับผิดชอบ และใช้ข้อมูลประกอบการตัดสินใจเกี่ยวกับทีมของตนได้อย่างรอบคอบ

source: Worker acknowledgment
th_th: การรับทราบของพนักงาน

source: The review was validated by
th_th: การประเมินได้รับการตรวจสอบโดย

source: This snapshot reflects the status of the behaviors as of {{date}}.
th_th: สแนปชอตนี้สะท้อนสถานะของพฤติกรรม ณ วันที่ {{date}}.

source: This snapshot reflects the status of the goals as of {{date}}.
th_th: สแน็ปช็อตนี้สะท้อนสถานะของเป้าหมาย ณ วันที่ {{date}}

source: Let’s discuss on
th_th: มาพูดคุยกันเกี่ยวกับ

source: Edited
th_th: แก้ไขแล้ว

source: No changes
th_th: ไม่มีการเปลี่ยนแปลง

source: Unrated
th_th: ยังไม่ได้ให้คะแนน

source: Overall performance rating
th_th: คะแนนการประเมินผลงานโดยรวม

source: No comment provided
th_th: ไม่มีความคิดเห็น

source: No input provided
th_th: ไม่ได้มีการป้อนข้อมูล

source: Confirmation of my performance conversation
th_th: การยืนยันการสนทนาผลการปฏิบัติงานของฉัน

source: Closed (system)
th_th: ปิด (ระบบ)

source: Moderation
th_th: การตรวจทาน

source: Pending sign-off
th_th: รอการอนุมัติสิ้นสุด

source: Pending validation
th_th: รอการยืนยัน

source: Pending publication
th_th: รอการเผยแพร่

source: Review autoclosed date
th_th: ตรวจสอบวันที่ปิดอัตโนมัติ

source: Worker sign-off date
th_th: วันที่ลงนามโดยพนักงาน

source: Review closed date
th_th: วันที่ปิดการทบทวน

source: Evaluation period
th_th: ช่วงการประเมินผล

source: Type & status
th_th: ประเภทและสถานะ

source: Start
th_th: เริ่มต้น

source: Worker sign-off
th_th: การลงนามรับทราบของพนักงาน

source: Additional manager
th_th: ผู้จัดการเพิ่มเติม

source: Manager+1
th_th: ผู้จัดการ+1

source: Review about
th_th: รีวิวเกี่ยวกับ

source: Approve or reject with an optional comment.
th_th: อนุมัติหรือปฏิเสธพร้อมความคิดเห็นเพิ่มเติมได้

source: Add my direct reports
th_th: เพิ่มรายงานโดยตรงของฉัน

source: Comment not saved
th_th: ไม่สามารถบันทึกความคิดเห็นได้

source: You don't have any reports
th_th: คุณไม่มีรายงานใดๆ

source: Total workers: {{workersSize}}
th_th: จำนวนพนักงานทั้งหมด: {{workersSize}}

source: Any compensation rounds assigned to you will be visible here.
th_th: รอบการชดเชยใด ๆ ที่ได้รับมอบหมายให้กับคุณจะแสดงที่นี่

source: No compensation rounds yet!
th_th: ยังไม่มีรอบการชดเชยในขณะนี้!

source: View and manage all compensation rounds.
th_th: ดูและจัดการรอบการชดเชยทั้งหมด

source: Compensation rounds
th_th: รอบการชดเชย

source: Search by comp round name
th_th: ค้นหาตามชื่อรอบการจ่ายผลตอบแทน

source: Workflow status
th_th: สถานะเวิร์กโฟลว์

source: Select workers to compare them.
th_th: เลือกพนักงานเพื่อเปรียบเทียบ

source: The outcome of the column is based on the formula below.
th_th: ผลลัพธ์ของคอลัมน์นี้อ้างอิงตามสูตรด้านล่าง

source: Calculated column formula
th_th: สูตรคำนวณคอลัมน์

source: You must add a note when entering a value.
th_th: คุณต้องเพิ่มบันทึกเมื่อป้อนค่า

source: You must add a note for values outside the guidelines.
th_th: คุณต้องเพิ่มหมายเหตุสำหรับค่าที่อยู่นอกเหนือแนวทางที่กำหนด

source: <0><1>Field related to {{name}}</1><3>{{helpTip}}</3></0>
th_th: <0><1>ฟิลด์ที่เกี่ยวข้องกับ {{name}}</1><3>{{helpTip}}</3></0>

source: The calculation cannot be done because {{column}} is empty.
th_th: ไม่สามารถทำการคำนวณได้ เนื่องจาก {{column}} ว่างเปล่า

source: The calculation cannot be done because a reference filed is empty.
th_th: การคำนวณไม่สามารถทำได้ เนื่องจากฟิลด์ข้อมูลอ้างอิงว่างเปล่า

source: Rules are applied in priority order from top to bottom.
th_th: กฎจะถูกนำไปใช้ตามลำดับความสำคัญจากบนลงล่าง

source: Comp round currency ({{currencyCode}})
th_th: ปัดเศษสกุลเงิน ({{currencyCode}})

source: Choose grid currency
th_th: เลือกสกุลเงินของกริด

source: Worker local currency
th_th: สกุลเงินท้องถิ่นของพนักงาน

source: The data might be out of sync. Refresh the data to get the latest changes.
th_th: ข้อมูลอาจไม่ตรงกัน กรุณารีเฟรชข้อมูลเพื่อรับการเปลี่ยนแปลงล่าสุด

source: No compensation rounds to display
th_th: ไม่มีรอบการจ่ายผลตอบแทนที่จะแสดง

source: Clear field
th_th: ล้างฟิลด์

source: This field only accepts values within the allowed amount range. Do you want to revert to the previous amount?
th_th: ฟิลด์นี้ยอมรับเฉพาะค่าที่อยู่ในช่วงจำนวนที่อนุญาตเท่านั้น คุณต้องการกลับไปใช้จำนวนก่อนหน้านี้หรือไม่

source: Revert
th_th: ย้อนกลับ

source: Out of range
th_th: อยู่นอกช่วง

source: Maximum: {{value}}
th_th: สูงสุด: {{value}}

source: Minimum: {{value}}
th_th: ขั้นต่ำ: {{value}}

source: Guideline
th_th: แนวทางปฏิบัติ

source: Achievement
th_th: ความสำเร็จ

source: Bonus payout
th_th: การจ่ายโบนัส

source: The decimal precision is set to 2.
th_th: ความละเอียดทศนิยมถูกตั้งไว้ที่ 2 หลัก

source: Type weight
th_th: ประเภทน้ำหนัก

source: Situation
th_th: สถานการณ์

source: Situations
th_th: สถานการณ์

source: No bonus situations available
th_th: ไม่มีสถานการณ์โบนัสที่พร้อมใช้งาน

source: {{fromDate}} to {{toDate}}
th_th: {{fromDate}} ถึง {{toDate}}

source: LoA factor: {{loaFactor}}
th_th: ปัจจัย LoA: {{loaFactor}}

source: Target bonus: {{targetBonus}}
th_th: โบนัสเป้าหมาย: {{targetBonus}}

source: TiR factor: {{tirFactor}}
th_th: ปัจจัย TiR: {{tirFactor}}

source: Total bonus: {{totalBonus}}
th_th: โบนัสรวม: {{totalBonus}}

source: Total bonus (all periods)
th_th: โบนัสรวม (ทุกช่วงเวลา)

source: Maximum amount
th_th: จำนวนสูงสุด

source: Minimum amount
th_th: จำนวนขั้นต่ำ

source: Eligible to {{eligibleCount}} of {{totalCount}} comp elements
th_th: มีสิทธิ์สำหรับ {{eligibleCount}} จาก {{totalCount}} องค์ประกอบ comp

source: You don't have any workers in this view.
th_th: คุณไม่มีพนักงานในมุมมองนี้

source: No comp rounds with round name "{{phrase}}"
th_th: ไม่มีรอบการจ่ายผลตอบแทนที่มีชื่อรอบว่า " {{phrase}} "

source: Date from
th_th: วันที่จาก

source: Date to
th_th: วันที่ถึง

source: Editor
th_th: บรรณาธิการ

source: Updated field
th_th: ฟิลด์ที่อัปเดต

source: Workflow stage
th_th: ขั้นตอนเวิร์กโฟลว์

source: Proxied by {{userName}}
th_th: พร็อกซีโดย {{userName}}

source: Reapproved
th_th: อนุมัติอีกครั้ง

source: Republished round
th_th: รอบการเผยแพร่ซ้ำ

source: Republished round (proposals removed)
th_th: รอบที่เผยแพร่อีกครั้ง (ลบข้อเสนอออกแล้ว)

source: Republished round (proposals kept)
th_th: เผยแพรรอบใหม่ (เก็บข้อเสนอตามเดิม)

source: Resubmitted
th_th: ส่งใหม่

source: Set default value
th_th: ตั้งค่าค่าเริ่มต้น

source: Input
th_th: อินพุต

source: Allocated
th_th: จัดสรรแล้ว

source: Base salary
th_th: เงินเดือนพื้นฐาน

source: Show budget
th_th: แสดงงบประมาณ

source: Eligible workers
th_th: พนักงานที่มีคุณสมบัติเหมาะสม

source: Budget info
th_th: ข้อมูลงบประมาณ

source: overspent out of {{budget}}
th_th: ใช้จ่ายเกิน {{budget}}

source: Remaining
th_th: ที่เหลืออยู่

source: remaining out of {{budget}}
th_th: เหลือจาก {{budget}}

source: spent out of {{budget}}
th_th: ใช้ไปแล้วจาก {{budget}}

source: Budget warning
th_th: คำเตือนงบประมาณ

source: Compensation navigation
th_th: การนำทางค่าตอบแทน

source: Export to Excel
th_th: ส่งออกไปยัง Excel

source: Export all pages
th_th: ส่งออกทุกหน้า

source: Export current page
th_th: ส่งออกหน้านี้

source: Select pages:
th_th: เลือกหน้า:

source: This download isn’t available because the selection exceeds the {{limit}} worker limit. Please narrow your selection to continue. For large exports or assistance, contact Customer Support.
th_th: ไม่สามารถดาวน์โหลดได้ เนื่องจากตัวเลือกที่คุณเลือกเกินขีดจำกัดจำนวนพนักงาน {{limit}} คน โปรดจำกัดขอบเขตตัวเลือกของคุณเพื่อดำเนินการต่อ หากต้องการส่งออกข้อมูลจำนวนมากหรือขอความช่วยเหลือ โปรดติดต่อฝ่ายสนับสนุนลูกค้า

source: No results match the filter search/filter criteria.<br/> Remove filters and the clear search to show all results.
th_th: ไม่มีผลลัพธ์ที่ตรงกับเกณฑ์การค้นหา/ตัวกรอง <br/> ลบตัวกรองและล้างการค้นหาเพื่อแสดงผลลัพธ์ทั้งหมด

source: Comp review
th_th: การทบทวนค่าตอบแทน

source: Search by worker name
th_th: ค้นหาตามชื่อพนักงาน

source: Audit
th_th: การประเมินผลงาน

source: Selected: {{count}}
th_th: เลือกแล้ว: {{count}}

source: Status set to completed
th_th: สถานะถูกตั้งเป็นเสร็จสมบูรณ์

source: You are about to move 1 worker to the next step. Are you sure you want to continue?
th_th: คุณกำลังจะย้ายพนักงาน 1 คนไปยังขั้นตอนถัดไป คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?

source: Successfully approved
th_th: อนุมัติสำเร็จ

source: Approve worker proposal
th_th: อนุมัติข้อเสนอของพนักงาน

source: Complete
th_th: เสร็จสิ้น

source: You are about to complete the worker proposal. Are you sure you want to continue?
th_th: คุณกำลังจะส่งข้อเสนอของผู้ปฏิบัติงาน คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?

source: Complete worker proposal
th_th: ข้อเสนอพนักงานฉบับสมบูรณ์

source: You are about to move 1 worker to the previous step. Are you sure you want to continue?
th_th: คุณกำลังจะย้ายคนงาน 1 คนกลับไปยังขั้นตอนก่อนหน้า คุณแน่ใจหรือไม่ว่าต้องการทำต่อไป?

source: The status was successfully set to rejected.
th_th: เปลี่ยนสถานะเป็นปฏิเสธเรียบร้อยแล้ว

source: Reject worker proposal
th_th: ปฏิเสธข้อเสนอของพนักงาน

source: The proposal was rejected.
th_th: ข้อเสนอถูกปฏิเสธ

source: The proposal was returned to the previous step for adjustments.
th_th: ข้อเสนอถูกส่งกลับไปยังขั้นตอนก่อนหน้าเพื่อปรับแก้

source: Awaiting approval
th_th: รอการอนุมัติ

source: Awaiting proposal
th_th: กำลังรอข้อเสนอ

source: The proposal was successfully submitted.
th_th: ข้อเสนอถูกส่งสำเร็จแล้ว

source: Submit worker proposal
th_th: ส่งข้อเสนอจากผู้ปฏิบัติงาน

source: Please add a justification for any proposal outside of guidelines.
th_th: โปรดระบุเหตุผลสำหรับข้อเสนอใด ๆ ที่อยู่นอกเหนือแนวทางที่กำหนด

source: You must add a note for this comp element.
th_th: คุณต้องเพิ่มบันทึกสำหรับองค์ประกอบ comp นี้

source: Add note (required)
th_th: เพิ่มบันทึก (จำเป็น)

source: Note added successfully
th_th: เพิ่มบันทึกสำเร็จแล้ว

source: Note required
th_th: จำเป็นต้องมีหมายเหตุ

source: Your unsaved changes were successfully discarded.
th_th: การเปลี่ยนแปลงที่ยังไม่ได้บันทึกของคุณถูกยกเลิกเรียบร้อยแล้ว

source: You must add a note when the value falls outside the guidelines. If you remove the note, the value will return to its previous state.
th_th: คุณต้องเพิ่มบันทึกเมื่อค่าดังกล่าวอยู่นอกเหนือแนวทางที่กำหนด หากคุณลบบันทึก ค่าจะกลับไปยังสถานะก่อนหน้า

source: You must add a note when entering a value. If you remove the note, the value will return to its previous state.
th_th: คุณต้องเพิ่มบันทึกเมื่อป้อนค่า หากคุณลบบันทึกนั้น ค่าจะกลับไปเป็นสถานะก่อนหน้า

source: Are you sure you want to delete this note?
th_th: คุณแน่ใจหรือว่าต้องการลบบันทึกนี้?

source: Note deleted successfully
th_th: ลบหมายเหตุเรียบร้อยแล้ว

source: Note edited successfully
th_th: แก้ไขบันทึกสำเร็จแล้ว

source: Fields
th_th: ฟิลด์

source: Choose the field related to this note.
th_th: เลือกสาขาที่เกี่ยวข้องกับบันทึกนี้

source: Item not found
th_th: ไม่พบรายการ

source: Unavailable
th_th: ไม่พร้อมใช้งาน

source: Choose the field related to this note. Unavailable fields from will be removed after saving.
th_th: เลือกฟิลด์ที่เกี่ยวข้องกับบันทึกนี้ ฟิลด์ที่ไม่สามารถใช้งานได้จะถูกลบออกหลังจากบันทึก

source: Max: {{guideline}}
th_th: สูงสุด: {{guideline}}

source: Min: {{guideline}}
th_th: ขั้นต่ำ: {{guideline}}

source: Min: {{min}} - Max: {{max}}
th_th: ขั้นต่ำ: {{min}} - สูงสุด: {{max}}

source: {{input}} (outside of guidelines)
th_th: {{input}} (นอกเหนือจากแนวทาง)

source: This note will be visible to everyone reviewing this worker in the compensation round.
th_th: บันทึกนี้จะปรากฏให้ทุกคนที่กำลังตรวจสอบพนักงานรายนี้ในรอบการชดเชยเห็น

source: Add your note
th_th: เพิ่มบันทึกของคุณ

source: The note is required.
th_th: จำเป็นต้องมีบันทึกนี้

source: Note (required)
th_th: หมายเหตุ (จำเป็น)

source: No notes
th_th: ไม่มีบันทึก

source: This item does not contain any notes
th_th: รายการนี้ไม่มีบันทึกย่อใด ๆ

source: Proposal management is applied to this column.
th_th: การจัดการข้อเสนอถูกนำมาใช้กับคอลัมน์นี้

source: Value overridden by user
th_th: ค่าที่ผู้ใช้เขียนทับ

source: Restore value
th_th: กู้คืนค่า

source: Unable to calculate
th_th: ไม่สามารถคำนวณได้

source: Select worker
th_th: เลือกพนักงาน

source: There aren’t enough data to display the behavior wheel. Give this worker feedback to complete their performance picture.
th_th: ข้อมูลไม่เพียงพอสำหรับการแสดงวงล้อพฤติกรรม ให้ฟีดแบคแก่พนักงานรายนี้เพื่อให้เห็นภาพประสิทธิภาพการทำงานของพวกเขา

source: No check-ins scheduled. Schedule one to discuss their growth.
th_th: ไม่มีการกำหนดเวลาเช็คอิน กำหนดตารางเวลาเพื่อหารือเกี่ยวกับการเติบโตของพวกเขา

source: This team member has no public feedback.
th_th: สมาชิกทีมนี้ไม่มีผลตอบรับจากสาธารณะ

source: You haven’t sent any feedback yet. Share your thoughts to help your team members grow.
th_th: คุณยังไม่ได้ส่งข้อเสนอใดๆ แบ่งปันความคิดเห็นของคุณเพื่อช่วยให้สมาชิกในทีมของคุณเติบโต

source: This team member hasn’t shared any feedback with you yet.
th_th: สมาชิกทีมนี้ยังไม่ได้แบ่งปันฟีดแบคใด ๆ กับคุณเลย

source: This team member has no goals yet. Create goals to help their progress.
th_th: สมาชิกทีมนี้ยังไม่มีเป้าหมาย สร้างเป้าหมายเพื่อช่วยให้พวกเขาก้าวหน้า

source: The CSV file could not be downloaded. Please try again later.
th_th: ไม่สามารถดาวน์โหลดไฟล์ CSV ได้ โปรดลองอีกครั้งในภายหลัง

source: Download failed
th_th: ดาวน์โหลดไม่สำเร็จ

source: Synchronize to check for available analyses.
th_th: ซิงโครไนซ์เพื่อตรวจสอบการวิเคราะห์ที่มีอยู่

source: No pay analysis available
th_th: ไม่พบการวิเคราะห์ค่าตอบแทน

source: View and manage all pay analyses
th_th: ดูและจัดการการวิเคราะห์ค่าตอบแทนทั้งหมด

source: Analyses
th_th: การวิเคราะห์

source: Submit recommendation
th_th: ส่งคำแนะนำ

source: The recommendation was successfully submitted.
th_th: ส่งคำแนะนำเรียบร้อยแล้ว

source: Could not load notes. Please try again.
th_th: ไม่สามารถโหลดบันทึกได้ กรุณาลองอีกครั้ง

source: Auto-generated
th_th: สร้างโดยอัตโนมัติ

source: Choose one...
th_th: เลือกหนึ่งรายการ...

source: You must select a communication round before closing the request in order to release the document to the worker.
th_th: คุณต้องเลือกรอบการสื่อสารก่อนปิดคำขอ เพื่อเผยแพร่เอกสารให้กับพนักงาน

source: The communication round cannot be empty when closing a pay information request with attached documents.
th_th: รอบการสื่อสารต้องไม่เว้นว่างเมื่อปิดคำขอข้อมูลค่าจ้างที่มีเอกสารแนบอยู่

source: Create request
th_th: สร้างคำขอ

source: The pay information request was successfully created.
th_th: สร้างคำขอข้อมูลการจ่ายค่าตอบแทนเรียบร้อยแล้ว

source: This date corresponds to the request creation date in the system.
th_th: วันที่นี้สอดคล้องกับวันที่สร้างคำขอในระบบ

source: Creation type
th_th: ประเภทการสร้าง

source: Document preview
th_th: ตัวอย่างเอกสาร

source: Edit request
th_th: แก้ไขคำขอ

source: Attached document
th_th: เอกสารที่แนบมา

source: The data source is required to generate and preview the document.
th_th: แหล่งข้อมูลเป็นสิ่งจำเป็นในการสร้างและแสดงตัวอย่างเอกสาร

source: Generate document
th_th: สร้างเอกสาร

source: Import a static document
th_th: นำเข้าเอกสารแบบคงที่

source: The internal note is not visible to the worker.
th_th: บันทึกภายในจะไม่แสดงให้พนักงานเห็น

source: The file name cannot contain more than 100 characters.
th_th: ชื่อไฟล์ต้องมีความยาวไม่เกิน 100 อักขระ

source: The file name cannot be empty.
th_th: ไม่สามารถเว้นชื่อไฟล์ว่างได้

source: Define the name of the document that will be distributed to workers.
th_th: กำหนดชื่อเอกสารที่จะส่งมอบให้พนักงาน

source: The pay information request was successfully saved.
th_th: บันทึกคำขอข้อมูลค่าตอบแทนเรียบร้อยแล้ว
